const AboutUs = () => {
    return (
        <div className="text-white flex justify-center items-center h-[100vh]">
            <div className="flex flex-col gap-y-4 mt-5 w-[70%]">
                <h1 className="text-3xl font-bold px-10 text-center">О Нашем проекте</h1>
                <p className="">
                    Добро пожаловать на наш фан-сайт, посвящённый игре <strong>Silver Palace</strong> — одному из самых ожидаемых проектов в мире гейминга!
                </p>
                <p className="">
                    Мы собираем и публикуем всю самую актуальную информацию: свежие новости, гайды для новичков и опытных игроков,
                    разборы персонажей, а также инсайды и сливы, появляющиеся до официального релиза.
                    Наша цель — быть первым и самым надёжным источником информации по Silver Palace.
                </p>
                <p>
                    Мы — команда игроков, таких же увлечённых, как и вы. Мы любим разбираться в механиках, искать скрытые детали
                    и делиться своими находками с сообществом. Если вы тоже ждёте выход Silver Palace и хотите быть в курсе всего,
                    что происходит вокруг игры — вы попали по адресу!                
                    </p>
                <p>
                    Следите за обновлениями, комментируйте, делитесь с друзьями и становитесь частью нашего сообщества!

                </p>
            </div>
        </div>
    );
};

export { AboutUs };
